DataProcessors/ВыгрузитьОстаткиНоменклатурыВЦСВДляПорталаЧери.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузитьОстаткиНоменклатурыВЦСВДляПорталаЧери</Name>
			<Comment>Выгрузить остатки номенклатуры в CSV для портала CHERY</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСОстатками</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Excel</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДилера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтозапускОбработкиПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дилер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДилера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвободныйОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РозничнаяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации компании</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Comment>Форма собственности контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации организации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГНИОрганизации</Name>
					<Comment>Наименование налоговой инспекции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКОПФ</Name>
					<Comment>Код организационно-правовой формы организации по КОПФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКФС</Name>
					<Comment>Код формы собственности по ОКФС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Comment>Код вида экономической деятельности по ОКВЭД</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКДП</Name>
					<Comment>Код по ОКДП основного вида деятельности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКОНХ</Name>
					<Comment>Код отрасли по ОКОНХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>Код по ОКПО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>Код ИМНС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Comment>Основной государственный регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс автонумерации для документов (до 3-х букв)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Основной банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого контрагента, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСервиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительКлиенскойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НельзяРеализовыватьЗапчасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Comment>Система налогообложения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Comment>Объект налогообложения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Вид налога</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОператора</Name>
					<Comment>Код оператора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВОптовыхПродажах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВПродажахБУавтомобилей</Name>
					<Comment>Участвует в продажах автомобилей с пробегом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВыгрузитьОстаткиНоменклатурыВЦСВДляПорталаЧери/Ext/ObjectModule.bsl
//&НаКлиенте
//Процедура ОтправкаФайлаНаСервер()
//                    ДвоичныеДанные=Новый ДвоичныеДанные(ИмяФайла);
//                    АдресВХ = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
//КонецПроцедуры

//&НаСервере
//Процедура ПолучениеФайлаНаСервере(АдресВХ)
//                    ИмяВременногоФайла = ПолучитьИмяВременногоФайла(«xls»);
//                    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
//                    ДвоичныеДанные.Записать(ИмяВременногоФайла);
//КонецПроцедуры

Процедура ВыгрузитьКоммерческиеЗННаПортал() Экспорт
 	
	//ИмяФайла = "C:\Program Files\CheryServiceDataUploader\DataToSend\file1.txt";
	//ИмяФайлаСРаботами = "C:\Program Files\CheryServiceDataUploader\DataToSend\file2.txt"; 
	
	Дилер = Справочники.Организации.НайтиПоРеквизиту("ИНН","6168069282");
	КодДилера = "6125600";
	
	ГдеСоздавать = КаталогВременныхФайлов();
	ИмяФайла = ГдеСоздавать+"file1.txt";
	ИмяФайлаСРаботами = ГдеСоздавать+"file2.txt";

	//=========================== 1 часть ===
 	
 	ГарантияПроизводителя          = Справочники.ВидыРемонта.ГарантияПроизводителя;
	ГарантияПроизводителяЛКП       = Справочники.ВидыРемонта.ГарантияПроизводителяЛКП;
	ГарантияДистрибьютера          = Справочники.ВидыРемонта.ГарантияДистирибьютера;

	
	СзВидРемонта = Новый СписокЗначений;
 	СзВидРемонта.Добавить(ГарантияПроизводителя);
	СзВидРемонта.Добавить(ГарантияПроизводителяЛКП);
	СзВидРемонта.Добавить(ГарантияДистрибьютера);
 	
	сч = 0;
	
	ВсегоСтрок = Состав.Количество();
	ёё = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	" ";
	
 	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()-24*3600));
	Запрос.УстановитьПараметр("Марка", Справочники.Модели.НайтиПоКоду("ЦБ00003545"));
	Запрос.УстановитьПараметр("Организация", Дилер);
	Запрос.УстановитьПараметр("СзВидРемонта",СзВидРемонта);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//ТЗ.ВыбратьСтроку();
	
	ЭтотОбъект.РаботыЗН.Загрузить(ТЗ);
	
	ТЗ.Свернуть("Ссылка,Номер,Дата");
	
	ТЗ.Сортировать("Дата,Номер");
	
	ЭтотОбъект.Состав.Загрузить(ТЗ);
	
	Для Каждого Строка Из Состав Цикл
		
		ОбработкаПрерыванияПользователя();
		ёё = ёё + 1;
		Состояние("Обработано "+ёё+" из "+ВсегоСтрок+"; ( "+?(ВсегоСтрок > 0,СокрЛП(Цел(100*ёё/ВсегоСтрок))+"% )",""));
		
		ТекЗН = Строка.Ссылка;
		ТекАвто = ТекЗН.Автомобиль;
		ТекЗаказчик = ТекЗН.Заказчик;
		ТекДатаЗН = ТекЗН.Дата;
		
		Строка.Дилер = Дилер.НаименованиеДляПечати;
		Строка.КодДилера = КодДилера;
		Строка.ФИОВладельца = ТекЗаказчик;
		Строка.ТелефонВладельца = Прав(Строка.ФИОВладельца.ОсновнойТелефон,10);
		Строка.VIN = ТекАвто.VIN;
		Строка.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ТекАвто , Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если обЗначениеНеЗаполнено(Строка.ГосНомер) Тогда
			Строка.ГосНомер = "Б/Н";
		КонецЕсли; 
		Строка.Марка = ТекАвто.Модель.Марка;
		Строка.Модель = ТекАвто.Модель;
		Строка.Пробег = ТекЗН.Пробег;
		Если ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ТекЗаказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			Строка.ТипВладельца="ФЛ";
		Иначе
			Строка.ТипВладельца="ЮЛ";
		КонецЕсли; 
		Строка.КонтактноеЛицо = ТекЗаказчик;
		Строка.ТелефонКонтактногоЛица = Прав(ТекЗаказчик.ОсновнойТелефон,10);
		Строка.ДатаОбращения = ТекДатаЗН;
		
		Попытка
			Строка.ПричинаОбращения = ТекЗН.Работы[0].Работа;
		Исключение
			Строка.ПричинаОбращения = ТекЗН.ПричинаОбращения;
		КонецПопытки; 
		Строка.ДатаСозданияЗН     = ТекДатаЗН;
		Строка.ДатаНачалаРабот    = ТекДатаЗН;
		Строка.ДатаОкончанияРабот = ТекДатаЗН;
		Строка.ДатаЗакрытия       = ТекДатаЗН;
		
		Строка.ДобраяВоля         = "НЕТ";
		Строка.ТО                 = "НЕТ";
		Строка.СервиснаяКомпания  = "НЕТ";
		Строка.КузовнойРемонт     = "НЕТ";
		Строка.СлесарныйРемонт 	 = "НЕТ";
		Строка.Акция 	         = "НЕТ";
		
		Строка.ТипРемонта="Коммерческий";	
		
		Если ТекЗН.ВидРемонта = ГарантияПроизводителя ИЛИ ТекЗН.ВидРемонта = ГарантияПроизводителяЛКП ИЛИ ТекЗН.ВидРемонта = ГарантияДистрибьютера Тогда
			Строка.ТипРемонта="Гарантийный";	
		КонецЕсли; 
		
	КонецЦикла;
	
	//=========================== 2 часть ===
	
	ТекстЗН = Новый ТекстовыйДокумент; 
	
  	Для каждого Строка Из Состав Цикл
		ТекстЗН.ДобавитьСтроку(Строка.Дилер + ";"+
		Строка.КодДилера + ";"+
		Строка.Артикул + ";"+
		Строка.СвободныйОстаток + ";"+
		Строка.РозничнаяЦена); 
	КонецЦикла;
	
	Попытка
	   	ТекстЗН.Записать(ИмяФайла); 
 	Исключение
		//Сообщить("ОШИБКА! Не удалось записать файл с заголовками заказ-нарядов "+ИмяФайлаСработами);	
	КонецПопытки; 
 	
 
	//=========================== 3 часть ===
	
	Если Состав.Количество() > 0 Тогда
 			
		ДвоичныеДанныеЗН=Новый ДвоичныеДанные(ИмяФайла);
        АдресВХ_ЗН = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЗН);
			
		ДвоичныеДанныеРабот=Новый ДвоичныеДанные(ИмяФайлаСРаботами);
        АдресВХ_Работ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеРабот);

		СМ_CHERY.ВыгрузкаНаПорталЧери(АдресВХ_ЗН,АдресВХ_Работ);	
			
   	КонецЕсли; 
  	 
КонецПроцедуры
